<?php
$r_base = "../../"; // относительный путь до главной папки
$title = "Наследование. Полиморфизм. Абстрактные классы. Виртуальные методы";
$description = "Наследование. Полиморфизм. Абстрактные классы. Виртуальные методы";
$keywords = "";
//aside.config
$h1 = "Наследование. Полиморфизм. Абстрактные классы. Виртуальные методы";
//название папки относительно корня
$folder_name = "materials/inheritance/";
//ссылки вверху aside
$aside_links = '
<i class="fas fa-caret-right"></i> <a href="'.$folder_name.'lab/">Лабораторная работа №21</a>
';
//ссылки в меню
$aside_menu = '
<li><a href="'.$folder_name.'#1">Общая характеристика наследования</a></li>
<li><a href="'.$folder_name.'#2">Типы наследования</a></li>
<li><a href="'.$folder_name.'#3">Конструкторы и деструкторы</a></li>
<li><a href="'.$folder_name.'#4">Виртуальные функции</a></li>
<li><a href="'.$folder_name.'#5">Принцип подстановки</a></li>
<li><a href="'.$folder_name.'#6">Полиморфизм</a></li>
<li><a href="'.$folder_name.'#7">Абстрактные классы</a></li>
<li><a href="'.$folder_name.'#8">Список литературы</a></li>
';

?>