<?php
include ("index.config.php");
include ($r_base."assets/php_modules/addons.php");
?>
<!DOCTYPE html>
<html lang="ru">
<head>
    <?php include ($r_base."assets/php_modules/head.tpt.php"); ?>
</head>
<body>
<div class='container-fluid'>
<?php include ($r_base."assets/php_modules/header.tpt.php"); ?>  
<div class="row">
<?php include ($r_base."assets/php_modules/aside.tpt.php"); ?>
<main class="col-md markdown-body">
<h2 id="1">1. Постановка задачи</h2>
<div class="block__text text-justify">
    &#8195;&#8195;1.&#8195;Создать динамический массив из записей (в соответствии с вариантом), содержащий не менее 100 элементов. Для заполнения элементов массива использовать ДСЧ.
    <br>
    &#8195;&#8195;2.&#8195;Выполнить поиск элемента в массиве по ключу в соответствии с вариантом. Для поиска использовать хеш-таблицу.
    <br>
    &#8195;&#8195;3.&#8195;Подсчитать количество коллизий при размере хеш-таблицы 40, 75 и 90 элементов.
</div>

<h2 id="2">2. Варианты заданий</h2>

<table>
    <thead>
        <tr>
            <td>
                <b>№ варианта</b>
            </td>
            <td>
                <b>Данные</b>
            </td>
            <td>
                <b>Ключ (string)</b>
            </td>
            <td>
                <b>Хэш-функция</p>
            </td>
            <td>
                <b>Метод хеширования</b>
            </td>
        </tr>
    </thead>
    <tbody>
        
        <tr>
            <td>
                <p>1</p>
            </td>
            <td>
                <p>ФИО, группа, рейтинг</p>
            </td>
            <td>
                <p>ФИО</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>2</p>
            </td>
            <td>
                <p>ФИО, №счета, сумма</p>
            </td>
            <td>
                <p>№ счета</p>
            </td>
            <td>
                <p>H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>3</p>
            </td>
            <td>
                <p>ФИО, №счета, сумма</p>
            </td>
            <td>
                <p>ФИО</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>4</p>
            </td>
            <td>
                <p>ФИО, №паспорта, адрес</p>
            </td>
            <td>
                <p>№ паспорта</p>
            </td>
            <td>
                <p>H(k)= [M(kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>5</p>
            </td>
            <td>
                <p>ФИО, №паспорта, адрес</p>
            </td>
            <td>
                <p>ФИО</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>6</p>
            </td>
            <td>
                <p>ФИО, №паспорта, адрес</p>
            </td>
            <td>
                <p>Адрес</p>
            </td>
            <td>
                <p>H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>7</p>
            </td>
            <td>
                <p>ФИО, №телефона, адрес</p>
            </td>
            <td>
                <p>№телефона</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>8</p>
            </td>
            <td>
                <p>ФИО, №телефона, адрес</p>
            </td>
            <td>
                <p>ФИО</p>
            </td>
            <td>
                <p>	
                    H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>9</p>
            </td>
            <td>
                <p>ФИО, №телефона, адрес</p>
            </td>
            <td>
                <p>Адрес</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>10</p>
            </td>
            <td>
                <p>ФИО, №паспорта, №телефона</p>
            </td>
            <td>
                <p>№телефона</p>
            </td>
            <td>
                <p>H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>11</p>
            </td>
            <td>
                <p>ФИО, №паспорта, №телефона</p>
            </td>
            <td>
                <p>№паспорта</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>12</p>
            </td>
            <td>
                <p>ФИО, №паспорта, №телефона</p>
            </td>
            <td>
                <p>ФИО</p>
            </td>
            <td>
                <p>H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>13</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, адрес</p>
            </td>
            <td>
                <p>дата_рождения</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>14</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, адрес</p>
            </td>
            <td>
                <p>адрес</p>
            </td>
            <td>
                <p>H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>15</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, адрес</p>
            </td>
            <td>
                <p>ФИО</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>16</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, №телефона</p>
            </td>
            <td>
                <p>дата_рождения</p>
            </td>
            <td>
                <p>H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>17</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, №телефона</p>
            </td>
            <td>
                <p>ФИО</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>18</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, №телефона</p>
            </td>
            <td>
                <p>№телефона</p>
            </td>
            <td>
                <p>H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>19</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, №паспорта</p>
            </td>
            <td>
                <p>№паспорта</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>20</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, №паспорта</p>
            </td>
            <td>
                <p>дата_рождения</p>
            </td>
            <td>
                <p>H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>21</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, №телефона, №паспорта</p>
            </td>
            <td>
                <p>№телефона</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>22</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, №телефона, №паспорта</p>
            </td>
            <td>
                <p>№паспорта</p>
            </td>
            <td>
                <p>	
                    H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>23</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, №телефона, №паспорта</p>
            </td>
            <td>
                <p>дата_рождения</p>
            </td>
            <td>
                <p>H(k)=k mod M</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>24</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, №телефона, №паспорта</p>
            </td>
            <td>
                <p>№телефона</p>
            </td>
            <td>
                <p>H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод цепочек</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>25</p>
            </td>
            <td>
                <p>ФИО, дата_рождения, №телефона, №паспорта</p>
            </td>
            <td>
                <p>дата_рождения</p>
            </td>
            <td>
                <p>H(k)= [M (kAmod1)], 0&#60;A&#60;1, mod1 – получение дробной части, [] – получение целой части</p>
            </td>
            <td>
                <p>Метод открытой адресации</p>
            </td>
        </tr>
        
    </tbody>
</table>

<h2 id="3">3. Методические указания</h2>
<div class="block__text text-justify">
    &#8195;&#8195;1.&#8195;Для выбора действий использовать меню.
    <br>
    &#8195;&#8195;2.&#8195;Удаление должно осуществляться по ключевому полю и по номеру.
    <br>
    &#8195;&#8195;3.&#8195;Корректировка выполняется по ключу и по номеру.
</div>

<h2 id="4">4. Содержание отчета</h2>
<div class="block__text text-justify">
    &#8195;&#8195;1.&#8195;Постановка задачи (общая и для конкретного варианта)
    <br>
    &#8195;&#8195;2.&#8195;Анализ задачи
    <br>
    &#8195;&#8195;&#8195;&#8226;&#8195;Определения функций для реализации поставленных задач
    <br>
    &#8195;&#8195;&#8195;&#8226;&#8195;Определение функции main()
    <br>
    &#8195;&#8195;3.&#8195;Блок-схемы основных функций
    <br>
    &#8195;&#8195;4.&#8195;Текст программы
    <br>
    &#8195;&#8195;5.&#8195;Тесты
</div>
<?php
if ($sendwork_off == false) { ?>
    <h2 id="5">5. Отправить результат работы</h2>
    <?php include ($r_base."assets/php_modules/form_sendwork.tpt.php"); 
}
?>
</main><!--end main-->
</div><!--end .row-->
<?php include ($r_base."assets/php_modules/footer.tpt.php"); ?>  
</div><!--end .container-fluid-->
<?php include ($r_base."assets/php_modules/scripts.tpt.php"); ?>
</body>
</html>